---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.PropertySetElementFailures
source: html/9ada571a-ab3d-3691-6adb-ec59671b6f34.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PropertySetElementFailures

Failures related to property set elements.

## Syntax (C#)
```csharp
public static class PropertySetElementFailures
```